app/views/users/show.html.erb

    <%= render 'follow_form' if logged_in? %>
    <% if @user.microposts.any? %>
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]