app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "location" = ?, "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "takahiro_shiratora"], ["location", ""], ["description", ""], ["updated_at", "2015-09-22 15:05:53.179403"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)